Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [2]:
data = ["4", "8", "15", "16", "23", "42"]

In [8]:
panda_series =pd.Series(data)

In [9]:
panda_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

In [10]:
type(panda_series)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [35]:
list = ["145","shi","nitin","harshu","78.76","66.34","752","48","549","1450"]
series =pd.Series(list)
series

0       145
1       shi
2     nitin
3    harshu
4     78.76
5     66.34
6       752
7        48
8       549
9      1450
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [25]:
data1= {
    'Name' : ['Alice','Bob','Claire'],
    'Age' : [ '25','30','27'],
    'Gender' : ['Female','Male','Female']
}
dataframe_data = pd.DataFrame(data1)

In [26]:
dataframe_data

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [27]:
type(dataframe_data)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame:

A DataFrame is a two-dimensional, tabular data structure that is similar to a spreadsheet or SQL table.

It consists of rows and columns, where each column can have a different data type (e.g., integers, floats, strings, etc.).

Series:
    
A Series is a one-dimensional array-like object that can hold data of any type.

Series objects are often used to represent a single feature or attribute of a dataset.

In [34]:
#Example of dataFrame:

data1= {
    'Name' : ['Alice','Bob','Claire'],
    'Age' : [ '25','30','27'],
    'Gender' : ['Female','Male','Female']
}
dataframe_data = pd.DataFrame(data1)
dataframe_data

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [37]:
#Example of Series:
list = ["145","shi","nitin","78.76","66.34","752"]
series =pd.Series(list)
series

0      145
1      shi
2    nitin
3    78.76
4    66.34
5      752
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

1.head() and tail():

head(n) returns the first n rows of the DataFrame.

tail(n) returns the last n rows of the DataFrame.

In [77]:
#Example:
dataframe_data.head(3)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [44]:
dataframe_data.tail(2)

     Name Age  Gender
1     Bob  30    Male
2  Claire  27  Female

2. columns: way to access column names

In [46]:
#Example:

dataframe_data.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

3.pd.read_csv:

This is a function provided by Pandas to read csv files into a DataFrame.

It allows you to read data from csv files and work with it in Python.

In [60]:
#Example:

df = pd.read_csv("services.csv")

4.dtypes():

This is used to display the data types of each column in DataFrame df1.
    
It provides information about the type of data stored in each column.

In [51]:
#Example:

df.dtypes

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

5.  to_csv:

This is used to write a DataFrame  to a CSV (Comma Separated Values) file.

It allows you to save your DataFrame as a CSV file that can be opened in spreadsheet software.

In [54]:
dataframe_data.to_csv('output.csv', index=False)

6.describe():

Generates descriptive statistics (e.g., count, mean, min, max, etc.) for numerical columns.

In [59]:
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

7.groupby():

Allows you to group data based on one or more columns and perform operations on each group.

In [ ]:
df.groupby('audience')['eligibility'].mean()  # Computes the mean age for each gender group

8.fillna():
    
Fills missing values in the DataFrame with a specified value or method.

In [66]:
df.fillna(0).head(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,0.0,0,0,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",0,...,0,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",0,Fair Oaks Adult Activity Center,0,Colma,active,No wait.,0,0
1,2,2,0.0,0,0,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",0,...,0,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",0,Second Career Employment Program,0,San Mateo County,active,Varies.,0,0
2,3,3,0.0,0,0,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,0,...,0,"Geriatric Counseling, Older Adults, Gay, Lesbi...",0,Senior Peer Counseling,0,San Mateo County,active,Varies.,0,0

9. drop():

Allows you to remove rows or columns from the DataFrame.

In [70]:
df.drop(columns=['email'], inplace=True)  # Drops the 'alternate_name' column

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

 DataFrames are mutable, which means you can modify their contents by adding or removing rows and columns, changing values, and performing various data manipulation operations.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [76]:
series1 =["1","2","3","4","5"]
series2 = ["shivangi","nitin","anmol","harsh","bittu"]
series3 =["1/10","2/2","4/6","26/5","2/3"]

data = {"index":series1, "Name":series2 ,"DOB":series3 }

df_series = pd.DataFrame(data)
df_series

  index      Name   DOB
0     1  shivangi  1/10
1     2     nitin   2/2
2     3     anmol   4/6
3     4     harsh  26/5
4     5     bittu   2/3